tests/Fixtures/new_online_payment_order.json

{
    "order_lines": [
        {
            "id": "648472113",
            "order_id": "90431719",
            "sale_price": "5690",
            "full_sale_price": "5690",
            "total_price": "11380",
            "full_total_price": "11380",
            "discounts_amount": "0",
            "quantity": "2",
            "reserved_quantity": "2",
            "weight": "0.3",
            "dimensions": "30x30x3",
            "variant_id": "648101383",
            "product_id": "388433112",
            "sku": "6277 S",
            "barcode": "OZN1091644276",
            "title": "Шорты мужские HUGO (46 / белый)",
            "unit": "pce",
            "comment": null,
            "updated_at": "2023-12-22T14:43:53.000+03:00",
            "created_at": "2023-12-22T14:43:53.000+03:00",
            "bundle_id": null,
            "vat": "-1",
            "fiscal_product_type": "1",
            "requires_marking": null,
            "marking_codes": null,
            "external_variant_id": null
        },
        {
            "id": "648472114",
            "order_id": "90431719",
            "sale_price": "9500",
            "full_sale_price": "9500",
            "total_price": "9500",
            "full_total_price": "9500",
            "discounts_amount": "0",
            "quantity": "1",
            "reserved_quantity": "1",
            "weight": "0.4",
            "dimensions": "30x35x3",
            "variant_id": "648101384",
            "product_id": "388433113",
            "sku": "510 фиолетовый S",
            "barcode": "OZN1092676216",
            "title": "Спортивный костюм HUGO (46)",
            "unit": "pce",
            "comment": null,
            "updated_at": "2023-12-22T14:43:53.000+03:00",
            "created_at": "2023-12-22T14:43:53.000+03:00",
            "bundle_id": null,
            "vat": "-1",
            "fiscal_product_type": "1",
            "requires_marking": null,
            "marking_codes": null,
            "external_variant_id": null
        },
        {
            "id": "648472115",
            "order_id": "90431719",
            "sale_price": "5690",
            "full_sale_price": "5690",
            "total_price": "5690",
            "full_total_price": "5690",
            "discounts_amount": "0",
            "quantity": "1",
            "reserved_quantity": "1",
            "weight": "0.3",
            "dimensions": "30x30x3",
            "variant_id": "648101381",
            "product_id": "388433112",
            "sku": "6277 XL",
            "barcode": "OZN1091626043",
            "title": "Шорты мужские HUGO (58 / белый)",
            "unit": "pce",
            "comment": null,
            "updated_at": "2023-12-22T14:43:53.000+03:00",
            "created_at": "2023-12-22T14:43:53.000+03:00",
            "bundle_id": null,
            "vat": "-1",
            "fiscal_product_type": "1",
            "requires_marking": null,
            "marking_codes": null,
            "external_variant_id": null
        }
    ],
    "order_changes": [
        {
            "id": "1420900058",
            "created_at": "2023-12-22T14:43:53.756+03:00",
            "action": "order_created",
            "value_was": null,
            "value_is": null,
            "full_description": "Заказ создан пользователем Антон",
            "user_name": "Антон"
        }
    ],
    "discount": {
        "id": "34178877",
        "description": "Скидка от 11000",
        "type_id": "1",
        "amount": "1328.5",
        "full_amount": "1328.5",
        "percent": "5.0",
        "discount": "5.0",
        "reference_id": "4130271",
        "reference_type": "DiscountRule",
        "discount_code_id": null,
        "created_at": "2023-12-22T14:43:53.000+03:00",
        "updated_at": "2023-12-22T14:43:53.000+03:00"
    },
    "shipping_address": {
        "id": "98599377",
        "name": "Anton",
        "surname": null,
        "middlename": null,
        "phone": "+79126510464",
        "full_name": "Anton",
        "full_locality_name": null,
        "full_delivery_address": "ул. Крымская, 8",
        "address_for_gis": "ул. Крымская, 8",
        "location_valid": "true",
        "address": "ул. Крымская, 8",
        "country": null,
        "state": null,
        "city": null,
        "zip": null,
        "street": null,
        "house": null,
        "flat": null,
        "kladr_json": null,
        "location": {
            "kladr_code": null,
            "zip": null,
            "kladr_zip": null,
            "region_zip": null,
            "country": "RU",
            "state": null,
            "state_type": null,
            "area": null,
            "area_type": null,
            "city": null,
            "city_type": null,
            "settlement": null,
            "settlement_type": null,
            "address": "ул. Крымская, 8",
            "street": "Крымская",
            "street_type": "ул",
            "house": "8",
            "flat": null,
            "is_kladr": "false",
            "latitude": null,
            "longitude": null,
            "autodetected": null
        }
    },
    "client": {
        "id": "77192229",
        "email": "aner-anton@yandex.ru",
        "name": "Anton",
        "phone": "+79126510464",
        "created_at": "2023-11-20T17:21:47.000+03:00",
        "updated_at": "2023-12-22T14:43:53.000+03:00",
        "comment": null,
        "registered": "true",
        "subscribe": "true",
        "client_group_id": null,
        "surname": null,
        "middlename": null,
        "bonus_points": "0",
        "type": "Client::Individual",
        "correspondent_account": null,
        "settlement_account": null,
        "consent_to_personal_data": "true",
        "o_auth_provider": null,
        "messenger_subscription": "true",
        "contact_name": "Anton",
        "progressive_discount": null,
        "group_discount": null,
        "ip_addr": "46.138.165.14"
    },
    "discounts": [
        {
            "id": "34178877",
            "description": "Скидка от 11000",
            "type_id": "1",
            "amount": "1328.5",
            "full_amount": "1328.5",
            "percent": "5.0",
            "discount": "5.0",
            "reference_id": "4130271",
            "reference_type": "DiscountRule",
            "discount_code_id": null,
            "created_at": "2023-12-22T14:43:53.000+03:00",
            "updated_at": "2023-12-22T14:43:53.000+03:00"
        }
    ],
    "total_price": "25241.5",
    "items_price": "25241.5",
    "id": "90431719",
    "key": "90313c49814f34d544a3580f44f8bc32",
    "number": "1052",
    "comment": null,
    "archived": "false",
    "delivery_title": "СДЕК фуллфилмент",
    "delivery_description": "СДЕК фуллфилмент",
    "delivery_price": "250",
    "full_delivery_price": "250",
    "payment_description": "<p><span>Оплата наличными или банковской картой при получении заказа</span></p>",
    "payment_title": "Наличными или картой при получении",
    "first_referer": null,
    "first_current_location": "/",
    "first_query": null,
    "first_source_domain": null,
    "first_source": "Прямой трафик",
    "referer": "https://myshop-cdw517.myinsales.ru/",
    "current_location": "/?theme_preview=6304609",
    "query": null,
    "source_domain": "myshop-cdw517.myinsales.ru",
    "source": "Сайты",
    "fulfillment_status": "new",
    "custom_status": {
        "permalink": "new",
        "title": "Новый"
    },
    "delivered_at": null,
    "accepted_at": null,
    "created_at": "2023-12-22T14:43:53.000+03:00",
    "updated_at": "2023-12-22T14:43:53.000+03:00",
    "financial_status": "pending",
    "delivery_date": null,
    "delivery_from_hour": null,
    "delivery_from_minutes": null,
    "delivery_to_hour": null,
    "delivery_to_minutes": null,
    "paid_at": null,
    "delivery_variant_id": "7921162",
    "payment_gateway_id": "5982078",
    "margin": "0.0",
    "margin_amount": "0.0",
    "client_transaction_id": null,
    "currency_code": "RUR",
    "account_id": "5059015",
    "manager_comment": null,
    "locale": "ru",
    "delivery_info": {
        "delivery_variant_id": "7921162",
        "tariff_id": "136",
        "title": "Посылка склад-склад",
        "description": null,
        "price": "0",
        "shipping_company": null,
        "shipping_company_handle": null,
        "delivery_interval": {
            "min_days": null,
            "max_days": null,
            "description": null
        },
        "outlet": {
            "id": null,
            "external_id": null,
            "latitude": null,
            "longitude": null,
            "title": null,
            "description": null,
            "address": null,
            "source_id": null
        },
        "not_available": null,
        "type": "office",
        "address": {
            "city_code": "14493",
            "city": "Мирный",
            "type": "PVZ",
            "postal_code": "140060",
            "country_code": "RU",
            "region": "Московская область",
            "have_cashless": "true",
            "have_cash": "true",
            "allowed_cod": "true",
            "is_dressing_room": "true",
            "code": "MIR3",
            "name": "На Крымской, 8",
            "address": "ул. Крымская, 8",
            "work_time": "Пн-Пт 10:00-20:00, Сб-Вс 10:00-16:00",
            "location": ["37.945942", "55.62557"],
            "weight_min": "0",
            "weight_max": "50000",
            "dimensions": null,
            "apartment": null,
            "floor": null,
            "entrance": null,
            "intercom": null
        }
    },
    "responsible_user_id": null,
    "total_profit": "25241.5",
    "warehouse_id": "4100531"
}
